Revit 2027 API
FabricSheet.IsValidHost Method
Overload List
Name | Description
IsValidHost(Element) |  Checks whether an element is a valid host for fabric sheet.
IsValidHost(Document, ElementId) |  Checks whether an element is a valid host for fabric sheet.
Top
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace